Autodesk.Revit.DB.PartsVisibility
Indicates the visibility of parts for the view.
Since:
2012
Since:
2012

Autodesk.Revit.DB.PartsVisibility.ShowPartsAndOriginal
Show both original elements and parts for the view.

Autodesk.Revit.DB.PartsVisibility.ShowOriginalOnly
Show original elements, not parts, for the view.

Autodesk.Revit.DB.PartsVisibility.ShowPartsOnly
Show only parts for the view.

Autodesk.Revit.DB.PartsVisibility.Unset
Parts visibility is not set for the view.